Core/src/Documents/ПрочиеРасходы/ПрочиеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочиеРасходы</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПрочимиКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПрочихДоходовИРасходов</name>
    <type>
      <types>Characteristic.АналитикаДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетПрочихРасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаПрочихДоходовИРасходов</name>
      <type>
        <types>Characteristic.АналитикаДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>ТранзитныйСклад</name>
      <description>ტრანზიტული საწყობი</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Documents/ПрочиеРасходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область РасчетыПоПрочимОперациям

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаПрочиеРасходы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоПрочимОперациям", НСтр("ka='სხვა ოპერაციების მიხედვით ანგარიშსწორების აღრიცხვა';ru='Учет расчетов по прочим операциям'"));
	Запрос.УстановитьПараметр("КомментарийПриход", НСтр("ka='კონტრაგენტის ვალის გაზრდა';ru='Увеличение долга контрагента'"));
	Запрос.УстановитьПараметр("КомментарийРасход", НСтр("ka='კონტრაგენტის ვალის შემცირება';ru='Уменьшение долга контрагента'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПрочиеРасходы);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);  //+++ Дмгг
	
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПрочиеРасходыРасходы.Контрагент КАК Контрагент,
	|	ПрочиеРасходыРасходы.Договор КАК Договор,
	|	ПрочиеРасходыРасходы.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ПрочиеРасходыРасходы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ПрочиеРасходыРасходы.Ссылка.Дата КАК Период,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК Сумма,
	|	&УчетРасчетовПоПрочимОперациям КАК СодержаниеПроводки,
	|	&КомментарийПриход КАК Комментарий,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетУчета,
	//+++ Дмгг
	|	ПрочиеРасходыРасходы.СчетЗатратРегл КАК СчетУчетаРегл,
	//--- Дмгг
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.Сумма * КурсыВалютРасчетов.Кратность * КурсыВалютУчета.Курс / (КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаВал
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|		ПО ПрочиеРасходыРасходы.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	|	И ПрочиеРасходыРасходы.Ссылка.УчетПрочихРасчетов
	|	И ПрочиеРасходыРасходы.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//+++ Дмгг
	|	И (ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|			ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|			ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|	КОНЕЦ)
	//--- Дмгг
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	ПрочиеРасходыРасходы.Контрагент,
	|	ПрочиеРасходыРасходы.Договор,
	|	ПрочиеРасходыРасходы.Договор.ВалютаРасчетов,
	|	ПрочиеРасходыРасходы.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ПрочиеРасходыРасходы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ПрочиеРасходыРасходы.СчетЗатрат,
	//+++ Дмгг
	|	ПрочиеРасходыРасходы.СчетЗатратРегл,
	//--- Дмгг
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.Сумма * КурсыВалютРасчетов.Кратность * КурсыВалютУчета.Курс / (КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность) КАК ЧИСЛО(15, 2))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ПрочиеРасходы.Контрагент,
	|	ПрочиеРасходы.Договор,
	|	ПрочиеРасходы.Договор.ВалютаРасчетов,
	|	НЕОПРЕДЕЛЕНО,
	|	ПрочиеРасходы.Дата,
	|	СУММА(ПрочиеРасходыРасходы.Сумма),
	|	&УчетРасчетовПоПрочимОперациям,
	|	&КомментарийРасход,
	|	ПрочиеРасходы.Корреспонденция,
	//+++ Дмгг
	|	ПрочиеРасходы.КорреспонденцияРегл,
	//--- Дмгг
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.Сумма * КурсыВалютРасчетов.Кратность * КурсыВалютУчета.Курс / (КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность) КАК ЧИСЛО(15, 2))
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрочиеРасходы КАК ПрочиеРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютРасчетов
	|			ПО ПрочиеРасходы.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ПО ПрочиеРасходыРасходы.Ссылка = ПрочиеРасходы.Ссылка
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	|	И ПрочиеРасходы.Ссылка = &Ссылка
	|	И ПрочиеРасходыРасходы.Ссылка.УчетПрочихРасчетов
	|	И ПрочиеРасходы.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//+++ Дмгг
	|	И (ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходы.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|				ИЛИ ПрочиеРасходы.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|		ИНАЧЕ ПрочиеРасходы.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|				ИЛИ ПрочиеРасходы.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|	КОНЕЦ)
	//--- Дмгг
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	ПрочиеРасходы.Контрагент,
	|	ПрочиеРасходы.Договор,
	|	ПрочиеРасходы.Договор.ВалютаРасчетов,
	|	ПрочиеРасходы.Дата,
	|	ПрочиеРасходы.Корреспонденция,
	//+++ Дмгг
	|	ПрочиеРасходы.КорреспонденцияРегл,
	//--- Дмгг
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.Сумма * КурсыВалютРасчетов.Кратность * КурсыВалютУчета.Курс / (КурсыВалютРасчетов.Курс * КурсыВалютУчета.Кратность) КАК ЧИСЛО(15, 2))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПрочимиКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

#КонецОбласти

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПрочиеРасходы, СтруктураДополнительныеСвойства) Экспорт

	МассивСчетовФинРезРасходы = РегламентированныйУчетСервер.ПолучитьСчетаФинРезРасход();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПрочиеРасходыРасходы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ПрочиеРасходыРасходы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетУчета,
	|	ПрочиеРасходыРасходы.СчетЗатратРегл КАК СчетУчетаРегл,
	|	ПрочиеРасходыРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПрочиеРасходыРасходы.Сумма КАК Сумма,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&ПрочиеРасходы КАК СодержаниеПроводки
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	//+++ Дмгг
	|	И (ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|	КОНЕЦ)
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	//+++ Дмгг
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА
	|			ВЫБОР
	|				КОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|						ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|				ИНАЧЕ ПрочиеРасходыРасходы.НаправлениеДеятельности
	|			КОНЕЦ
	|		ИНАЧЕ                             
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ ПрочиеРасходыРасходы.НаправлениеДеятельности
	|	КОНЕЦ 
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ИНАЧЕ ПрочиеРасходыРасходы.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ 
	|		ИНАЧЕ 
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ИНАЧЕ ПрочиеРасходыРасходы.Ссылка.СтруктурнаяЕдиница
	|	КОНЕЦ 
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	//--- Дмгг
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетУчета,
	|	ПрочиеРасходыРасходы.СчетЗатратРегл КАК СчетУчетаРегл,
	//+++ Дмгг
	|	ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПрочиеРасходыРасходы.ЗаказПокупателя
	|	КОНЕЦ 
	|	ИНАЧЕ
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПрочиеРасходыРасходы.ЗаказПокупателя
	|	КОНЕЦ
	|	КОНЕЦ КАК ЗаказПокупателя,
	//--- Дмгг
	|	0 КАК СуммаДоходов,
	|	ПрочиеРасходыРасходы.Сумма КАК СуммаРасходов,
	|	ПрочиеРасходыРасходы.Сумма КАК Сумма,
	|	&ПрочиеРасходы КАК СодержаниеПроводки,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходов КАК Аналитика
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	//+++ Дмгг
	|	И (ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл В (&СчетаФинРезРасходы)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|				ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл В (&СчетаФинРезРасходы)
	|	КОНЕЦ)
	//--- Дмгг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК СуммаДоходов,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК Сумма,
	|	ПрочиеРасходыРасходы.Ссылка.Корреспонденция КАК СчетУчета,
	|	ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл КАК СчетУчетаРегл,
	|	&ПоступлениеДоходов КАК СодержаниеПроводки,
	|	ПрочиеРасходыРасходы.Ссылка.АналитикаПрочихДоходовИРасходов КАК Аналитика
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	//+++ Дмгг
	|	И ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|		ИНАЧЕ ПрочиеРасходыРасходы.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|	КОНЕЦ
	//--- Дмгг
	|	И ПрочиеРасходыРасходы.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.Ссылка,
	|	ПрочиеРасходыРасходы.Ссылка.Дата,
	|	ПрочиеРасходыРасходы.Ссылка.Корреспонденция,
	|	ПрочиеРасходыРасходы.Ссылка.АналитикаПрочихДоходовИРасходов,
	|	ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.Валютный
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.Валютный
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	ПрочиеРасходыРасходы.Ссылка.Корреспонденция КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Ссылка.Корреспонденция.Валютный
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Ссылка.Корреспонденция.Валютный
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалКт,
	|	ПрочиеРасходыРасходы.Сумма КАК Сумма,
	|	&ПрочееОприходование КАК Содержание
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	|	И ПрочиеРасходыРасходы.Сумма > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
	|	ПрочиеРасходыРасходы.Ссылка.Корреспонденция КАК СчетУчета,
	|	ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл КАК СчетУчетаРегл,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПокупателя,
	|	0 КАК СуммаДоходов,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК СуммаРасходов,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК Сумма,
	|	&ПрочиеРасходы КАК СодержаниеПроводки,
	|	ПрочиеРасходыРасходы.Ссылка.АналитикаПрочихДоходовИРасходов КАК Аналитика
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	//+++ Дмгг
	|	И (ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|				ИЛИ ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|		ИНАЧЕ ПрочиеРасходыРасходы.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|				ИЛИ ПрочиеРасходыРасходы.Ссылка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|	КОНЕЦ)
	|	И ПрочиеРасходыРасходы.Ссылка.УчетПрочихРасчетов
	|	И ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НераспределеннаяПрибыль)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|	КОНЕЦ
	//--- Дмгг
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.Ссылка.Дата,
	|	ПрочиеРасходыРасходы.Ссылка.Корреспонденция,
	|	ПрочиеРасходыРасходы.Ссылка.АналитикаПрочихДоходовИРасходов,
	|	ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	ПрочиеРасходыРасходы.Ссылка.Дата,
	|	&Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка),
	|	ПрочиеРасходыРасходы.Ссылка.Корреспонденция,
	|	ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл,
	|	НЕОПРЕДЕЛЕНО,
	|	ПрочиеРасходыРасходы.Сумма,
	|	0,
	|	ПрочиеРасходыРасходы.Сумма,
	|	&ПоступлениеДоходов,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходов
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	//+++ Дмгг
	|	И (ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|					ИЛИ ПрочиеРасходыРасходы.СчетЗатратРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|					ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|	КОНЕЦ)
	|	И ПрочиеРасходыРасходы.Ссылка.УчетПрочихРасчетов
	|	И (ВЫБОР
	|		КОГДА &ИспользованиеТолькоРеглПланаСчетов
	|			ТОГДА ПрочиеРасходыРасходы.Ссылка.КорреспонденцияРегл.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|					ИЛИ ПрочиеРасходыРасходы.Сумма < 0
	|		ИНАЧЕ ПрочиеРасходыРасходы.Ссылка.Корреспонденция.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|					ИЛИ ПрочиеРасходыРасходы.Сумма < 0
	|	КОНЕЦ)");
	//--- Дмгг
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПрочиеРасходы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	
	Запрос.УстановитьПараметр("ПрочиеРасходы", НСтр("ka='დანახარჯების ასახვა';ru='Отражение затрат'"));
	Запрос.УстановитьПараметр("ПоступлениеДоходов", НСтр("ka='სხვა შემოსავლები';ru='Прочие доходы'"));
	Запрос.УстановитьПараметр("ПрочееОприходование", НСтр("ka='სხვა ხარჯები (ხარჯები)';ru='Прочих затраты (расходы)'"));
	Запрос.УстановитьПараметр("СчетаФинРезРасходы", МассивСчетовФинРезРасходы);
	Запрос.УстановитьПараметр("ИспользованиеТолькоРеглПланаСчетов", СтруктураДополнительныеСвойства.ИспользованиеТолькоРеглПланаСчетов);  //+++ Дмгг
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", МассивРезультатов[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[1].Выгрузить());
	
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[2].Выгрузить());
	Иначе
		
		Выборка = МассивРезультатов[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", МассивРезультатов[3].Выгрузить());
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПрочиеРасходы(ДокументСсылкаПрочиеРасходы, СтруктураДополнительныеСвойства);
	// Щербаков ---
	
	// Прочие расчеты
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[4].Выгрузить());
	Иначе
		
		Выборка = МассивРезультатов[4].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаПрочиеРасходы, СтруктураДополнительныеСвойства);
	// Конец Прочие расчеты
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
